Revit 2016 API
BuiltInFailures.ConstraintFailures.UndeletedConstraints Property
 A Dimension that is labeled or has Lock and/or EQ Constraints is being deleted, but the elements will still be constrained. Push "Unconstrain" to remove the Constraints or "OK" to leave elements constrained..
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Syntax
C#
public static FailureDefinitionId UndeletedConstraints { get; }
Visual Basic
Public Shared ReadOnly Property UndeletedConstraints As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ UndeletedConstraints {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.ConstraintFailures Class
Autodesk.Revit.DB Namespace